Revit 2027 API
MultiReferenceAnnotationOptions.DimensionLineOrigin Property
 The origin point for the dimension line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ DimensionLineOrigin { get; set; }
Public Property DimensionLineOrigin As XYZ
	Get
	Set
public:
property XYZ^ DimensionLineOrigin {
	XYZ^ get ();
	void set (XYZ^ value);
}
member DimensionLineOrigin : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace